3/code/data/run_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       464;
    }
    outlet
    {
        type            patch;
        nFaces          8;
        startFace       474;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          6;
        startFace       482;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          30;
        startFace       488;
    }
    obstacle
    {
        type            patch;
        nFaces          26;
        startFace       518;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          504;
        startFace       544;
    }
)

// ************************************************************************* //
